{
/************************************************************************}


PROGRAM Mir2;

{$I common.pas}

Procedure _doexit;
begin
   This_Npc.CloseDialog(This_Player);
end;

procedure domain;
begin
    This_NPC.NpcDialog(This_Player,
   +'| <欢迎来到笑傲武林传奇，关于游戏有不懂的可以问我./c=red>\'
   +'| <阅读以下内容，有助于快速上手本传奇./c=red>\'
   +'| <游戏内所有装备全靠打，boos都会爆灵符，爆元宝./c=red>\'
	+'|<会员地图里的BOOS，普通地图也会刷，爆率是一样的./c=red>\'
	+'|<左上角布局，可以设置屏幕上的所有按钮，魔法/药品等快捷键./c=red>\'
	+'|<点击血球会出现，游戏里的所有功能菜单./c=red>\'
    +'|{cmd}<★如何升级★/@rhsj>   ^<★哪里打宝★/@nldb>   ^<★会员介绍★/@hyjs>\' 
    +'|{cmd}<★关于充值★/@rhcz>   ^<★如何摆摊★/@rhbt>     ^<★如何挂机★/@rhgj>\'  
    +'|{cmd}<★如何组队★/@rhzd>   ^<★物品捡取显示★/@wpjq>     ^<★装备介绍★/@zbjs>\' 
    +'|{cmd}<★道士宝宝★/@dsbb>   ^<★法师宝宝★/@fsbb>     ^<★宝宝攻击与休息★/@bbgj>\' 
    +'|{cmd}<★东西丢不掉★/@dxdb>     ^<★待添加★/c=red>'
        +'|                             <关闭/doexit>'
      ); 
end;


procedure _rhsj;
begin
      This_NPC.NpcDialog(This_Player,
      +'|先在野外砍到15级，然后去修炼圣地。\'
     +'|40级以前50倍经验，很好升级。\'
	  +'|盟重左上方每日可领取经验50W。\'
      +'|40级以后可以买卷轴挂机，或者泡点地图挂机。\'
	   +'|泡点免费每秒五千经验，10亿经验只需两天。\'
	   +'|泡点收费每秒30W经验 每秒1元宝。 \'
	   +'|泡点1小时可得10.8亿经验，土豪可以选收费泡点。\'
	   +'|强烈建议冲个会员，每天领经验，领神力附体。\'
	   +'|晚上睡觉时候在修炼圣地打怪挂机，升级比免费泡点快。\'
	   +'|但是要注意装备持久，0持久的装备只能用修复神水修复。\'
	    +'|                   ^<返回/@main>'
);
 
end;



procedure _nldb;
begin
  This_Npc.NpcDialog(This_Player,
   +'| 打装备地图介绍：\ \'
   +'| 会员地图里的boss，所有地图都会刷。\ \'
    +'| 散人不充钱，多花点时间也可以凑齐神装。\ \'
    +'| 沃玛三会刷暗之教主 爆魔龙以下装备。\ \'
   +'| 魔龙岭的小怪 爆战神及以下装备，全凭运气。\ \'
    +'| 魔龙岭，热血战场，沙藏宝阁，都是打装备的好地方。\ \'
   +'| 恶魔，魔龙树妖，魔龙教主，爆所有装备，但是难度大。\ \'
    +'| 免费地图也爆所有装备，如果人多可能抢不到BOSS。\'
    +'| 深渊魔域，钳虫巢穴等地图会刷暗之boss，爆所有装备。\'
    +'| 桃源之门可以合成前期厉害的武器，只需要金条和药水。\'
    +'| 土城内的房子和红名村会刷boss，具体哪些大家慢慢摸索。\'
   
  +'|                              <返回/@main>'
);
 

end;


procedure _rhcz;
begin
  This_Npc.NpcDialog(This_Player,
          +'| 充值方法：\ \'
   +'| 下方点击血球,右下角充值。\ \'   
    +'| 充值完成后,找土城元宝使者领取。\ \'  
   +'| 领取不了的,请找客服流云。\ \'
   +'| 或者直接找客服<流云/c=red>充值,多冲多返。\ \'
   +'| 充值200以上送 <初级斗笠/c=red>，★攻,魔,道,御+3★\ \'
   +'| 充值500以上送 <中级斗笠/c=red>，★攻,魔,道,御+6★\ \'  
   +'| 充值1000以上送 <高级斗笠/c=red>，★攻,魔,道,御+9★ \ \'    
   +'| 充值2000以上送 <终级斗笠/c=red>，★攻,魔,道,御+12★\ \'       
 

 +'|          <返回/@main>'
);
 
end;

procedure _rhbt;
begin
  This_Npc.NpcDialog(This_Player,
          +'| 摆摊方法：\ \'
   +'| 传送到庄园，点击血球出现菜单,\ \'   
    +'|  菜单里有摆摊按钮.\ \'  
  

 +'|          <返回/@main>'
);
 
end;

procedure _rhgj;
begin
  This_Npc.NpcDialog(This_Player,
          +'| 挂机方法：\ \'
    +'| 点击左上角，布局按钮，\ \'   
    +'| 找到挂机图标，把它拖到屏幕上.\ \'  
    

 +'|          <返回/@main>'
);
 
end;

procedure _rhzd;
begin
  This_Npc.NpcDialog(This_Player,
         +'组队方法：\ \'
    +'| 点击血球，会出现组队按钮，\ \'   
    +'| 在我的组队里面，勾上允许按钮，每次组队都要允许,\ \'  
    +'| 附近人里面点击要组队的人名，邀请组队,\ \'  
    +'| 或者直接输入玩家名字.\ \'  

 +'|          <返回/@main>'
);
 
end;

procedure _wpjq;
begin
  This_Npc.NpcDialog(This_Player,
      +'| 怪物爆太多东西，屏幕上显示太多名字,\ \'
    +'| 点击血球，进入设置里面，\ \'   
    +'| 物品菜单里，不要的物品 去掉勾选.\ \'  
  

 +'|          <返回/@main>'
);
 
end;

procedure _zbjs;
begin
  This_Npc.NpcDialog(This_Player,
           +'| 装备介绍：\ \'
    +'| 本服所有装备，大BOSS都会爆，\ \'   
    +'| 装备目前强弱依次是：\ \'  
    +'| 狂雷  2星王  3战神 \ \'  
    +'| 4强化系列  5魔龙  6赤月。\ \'  
    +'| 赤月以上的装备可以在庄园合成。\ \'  
    +'| 装备鉴定可以最多加10点属性。\ \'  
    +'| 庄园的鉴定师是随机加属性，价格一般。\ \'   
    +'| 庄园的幸运师是固定加属性，价格小贵。\ \'   
     +'| 注意！！所有会麻痹的怪物，都有几率爆特戒。\ \'   
    +'|          <返回/@main>'
);
 
end;

procedure _dsbb;
begin
  This_Npc.NpcDialog(This_Player,
           +'| 道士宝宝：\ \'
   +'| 道士召唤神兽，得到加强，\ \'   
    +'| 神兽替换成白虎，单挑小boos不是问题，\ \'  
    +'| 无论速度或者攻速，都大大提高，\ \'  
   +'| 道士升到47可学嗜血术，打宝神技。\ \'  
  
    +'|          <返回/@main>'
);
 
end;

procedure _fsbb;
begin
  This_Npc.NpcDialog(This_Player,
          +'| 法师宝宝：\ \'
  +'| 鹰卫，虎卫在白日门虎卫堂，每半小时刷3个，20级可召，\ \'    
  +'| 龙卫在虎卫堂门外，桃园之门的数量更多  42级左右可召，\ \'  
   +'| 900血的巨型虫魔免在未知暗殿刷  27级可召，\ \'  
   +'| 900血的半兽勇士物理免疫在封魔谷和白日门刷  45级可召，\ \'  
   +'| 其他宝宝可在盟重驯兽师NPC处召，需要付费金币。\ \'  
  
    +'|          <返回/@main>'
);
 
end;

procedure _bbgj;
begin
  This_Npc.NpcDialog(This_Player,
           +'| 宝宝操作：\ \'
   +'| 屏幕左上角的下属按钮，点击会休息，或攻击.\ \'    


    +'|          <返回/@main>'
);
 
end;

procedure _dxdb;
begin
  This_Npc.NpcDialog(This_Player,
           +'| 东西丢不掉怎么办?\ \'
    +'| 部分物品被绑定无法丢掉,\ \'    
      +'| 可以到盟重，垃圾清理处点击销毁.\ \'    

    +'|          <返回/@main>'
);
 
end;


procedure _hyjs;
begin
  This_Npc.NpcDialog(This_Player,
      +'| 会员介绍：\ \'
    +'| 会员价500元宝，永久，小冲玩家强烈推荐.\ \'
    +'| 不用管土豪一天满级，只要天天坚持，装备迟早一样.\ \'
	 +'| 每天领100W经验，金刚石，会员神水(开启神力)等.\ \'
	 +'| 最重要的各大地图传送免费！！可省去很多金币.\ \'
	+'|          <返回/@main>'
);
 
end;



Begin
  domain;
end.